app/controllers/carts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show

    if @usertype == "Guest" or @usertype == "Seller"
      redirect_to root_path
    elsif @usertype == "User"
      if @CurrentUser.id == params[:id].to_i
        setCart(params[:id])
      else
        redirect_to root_path
      end
    else
      @user = User.find(params[:id].to_i)