app/controllers/home_controller.rb

  def index
    @recentProducts = Product.order(:created_at).last(10)
---
SELECT  "products".* FROM "products" ORDER BY "products"."created_at" DESC LIMIT ?  [["LIMIT", 10]]