app/controllers/products_controller.rb

  def index

    @options = ["Price - Low -> High", "Price - High -> Low", "No Sort"]

    if params[:order].nil?
      helpers.clearTerm
    end

    @term = helpers.giveTerm

    if params[:term]
      @products = Product.where('lower(substancename) LIKE ?', "%#{params[:term].downcase}%")
      helpers.searchTerm(params[:term])
    elsif !@term.nil?
      @products = Product.where('lower(substancename) LIKE ?', "%#{@term.downcase}%")
    else
      @products = Product.all
    end

    if !params[:order].nil? && params[:order] == "0"
      @products = @products.order(:price).paginate(page: params[:page], per_page: 30)
      @ordering = "Price - Low -> High"
    elsif !params[:order].nil? && params[:order] == "1"
      @products = @products.order(price: :desc).paginate(page: params[:page], per_page: 30)
      @ordering = "Price - High -> Low"
    else
      @products = @products.paginate(page: params[:page], per_page: 30)
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]

  def show
    @seller = Seller.find_by(id: @product.seller_id)
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new

    if @usertype == "Admin" or @usertype == "Seller"
      @permission = true
    else
      @permission = false
    end

    if @permisson == false
      redirect_to "/"
    else

      if @usertype == "Seller"
        @Seller = Seller.where(id: @CurrentSeller.id)
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create

    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("substancename", "nonproprietaryname", "propname", "producttype", "dosageform", "routename", "marketingcategory", "activenumerator", "activeingredunit", "seller_id", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"