app/controllers/sellers_controller.rb

  def show
    @seller = Seller.find(params[:id])

    if @usertype != "Guest"
      if @usertype == "Admin"
        @ownerPrivileges = true

      elsif !@CurrentSeller.nil?
        if @CurrentSeller.id == @seller.id
          @ownerPrivileges = true
        end
      else
        @ownerPrivileges = false
      end
    end

    # Get all the products sold by the Seller
    @SellerItems = Product.where(seller_id: @seller.id)
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."seller_id" = ?  [["seller_id", 1]]

  def create
    @seller = Seller.new(seller_params)

    # @seller = Seller.new({"name" => seller_params["name"], "longitude" => seller_params["longitude"],
    #   "latitude" => seller_params["latitude"], "address" => seller_params["address"],
    #   "password_digest" => seller_params["password"]})

    respond_to do |format|
      if @seller.save
---
INSERT INTO "sellers" ("name", "longitude", "latitude", "address", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"